#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bucket.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST4"
      + name                        = "teraas-testLaunch TEraas124356UYTR"
      + project                     = "adeo-terraform"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.bucket.google_storage_bucket_iam_member.members["roles/storage.admin serviceAccount:teraas@dxp-teraas-dev-dtep.iam.gserviceaccount.com"] will be created
  + resource "google_storage_bucket_iam_member" "members" {
      + bucket = "teraas-testLaunch TEraas124356UYTR"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:teraas@dxp-teraas-dev-dtep.iam.gserviceaccount.com"
      + role   = "roles/storage.admin"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>
*Pusher: @toutantic, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform on Pull Request`*